# 2 Задача1
# На столе лежат n монеток. Некоторые из монеток лежат вверх решкой, а некоторые – гербом. Ваша задача - 
# # определить минимальное количество монеток, которые нужно перевернуть, чтобы все монетки лежали одной и той же стороной вверх.
# n= int(input("введите число монет: "))
# from random import randint
# a, b= 0, 0
# for i in range(n):
#     temp= randint(0,1)
#     print(temp, end=" ")
#     if temp > 0: a=+1
#     else: b +=1
# print()
# if a>b:
#  print(f"нужно повернуть {b} монет")
# else:
#  print(f"нужно повернуть {a} монет")


                                    #2 задача2
#Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
#Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
#Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные


